nrfconnect/sdk-nrf/samples/nrf9160/modem_shell/src/location/location_shell.c
	return service;
}

/******************************************************************************/

static void location_to_cloud_worker(struct k_work *work_item)
{
	struct gnss_location_work_data *data =
		CONTAINER_OF(work_item, struct gnss_location_work_data, work);
	int ret;
	char *body = NULL;

	/* If the position update was acquired by using GNSS, send it to nRF Cloud. */
	if (data->loc_evt_data.method == LOCATION_METHOD_GNSS) {
		/* Encode json payload in requested format, either NMEA or in PVT*/
		ret = location_cmd_utils_gnss_loc_to_cloud_payload_json_encode(
			data->format, &data->loc_evt_data.location, &body);
		if (ret) {
			mosh_error("Failed to generate nrf cloud NMEA or PVT, err: %d", ret);
			goto clean_up;
		}

		/* Send the encoded message to the nRF Cloud using either MQTT or REST transport */
#if defined(CONFIG_NRF_CLOUD_MQTT)
		struct nrf_cloud_tx_data mqtt_msg = {
			.data.ptr = body,
			.data.len = strlen(body),
			.qos = MQTT_QOS_1_AT_LEAST_ONCE,
			.topic_type = NRF_CLOUD_TOPIC_MESSAGE,
		};
		mosh_print("Sending acquired GNSS location to nRF Cloud via MQTT, body: %s", body);

		ret = nrf_cloud_send(&mqtt_msg);
		if (ret) {
			mosh_error("MQTT: location sending failed");
		}
#elif defined(CONFIG_NRF_CLOUD_REST)
#define REST_RX_BUF_SZ 300 /* No payload in a response, "just" headers */
		static char rx_buf[REST_RX_BUF_SZ];
		static char device_id[NRF_CLOUD_CLIENT_ID_MAX_LEN + 1];
		static struct nrf_cloud_rest_context rest_ctx = { .connect_socket = -1,
								  .keep_alive = false,
								  .rx_buf = rx_buf,
								  .rx_buf_len = sizeof(rx_buf),
								  .fragment_size = 0 };

		mosh_print("Sending acquired GNSS location to nRF Cloud via REST, body: %s", body);

		ret = nrf_cloud_client_id_get(device_id, sizeof(device_id));
		if (ret) {
			mosh_error("Failed to get device ID, error: %d", ret);
			goto clean_up;
		}

		ret = nrf_cloud_rest_send_device_message(&rest_ctx, device_id, body, false, NULL);
		if (ret) {
			mosh_error("REST: location sending failed: %d", ret);
		}
#endif
	}

clean_up:
	if (body) {
		cJSON_free(body);
	}
}

#if defined(CONFIG_DK_LIBRARY)
static void location_evt_led_worker(struct k_work *work_item)
{
	dk_set_led_off(LOCATION_STATUS_LED);
}
#endif

/******************************************************************************/

#if defined(CONFIG_LOCATION_SERVICE_EXTERNAL) && defined(CONFIG_NRF_CLOUD_AGPS)
static void location_ctrl_agps_ext_handle(const struct nrf_modem_gnss_agps_data_frame *agps_req)
{
#if defined(CONFIG_MOSH_CLOUD_LWM2M)
	int err;

	if (!cloud_lwm2m_is_connected()) {
		mosh_error("LwM2M not connected, can't request A-GPS data");
		return;
	}

	location_assistance_agps_set_mask(agps_req);

	while ((err = location_assistance_agps_request_send(cloud_lwm2m_client_ctx_get(), true)) ==
	       -EAGAIN) {
		/* LwM2M client utils library is currently handling a P-GPS data request, need to
		 * wait until it has been completed.
		 */
		k_sleep(K_SECONDS(1));
	}
	if (err) {
		mosh_error("Failed to request A-GPS data, err: %d", err);
	}
#endif /* CONFIG_MOSH_CLOUD_LWM2M */
}
#endif /* CONFIG_LOCATION_SERVICE_EXTERNAL && CONFIG_NRF_CLOUD_AGPS */

#if defined(CONFIG_LOCATION_SERVICE_EXTERNAL) && defined(CONFIG_NRF_CLOUD_PGPS)
static void location_ctrl_pgps_ext_handle(const struct gps_pgps_request *pgps_req)
{
#if defined(CONFIG_MOSH_CLOUD_LWM2M)
	int err = -1;

	if (!cloud_lwm2m_is_connected()) {
		mosh_error("LwM2M not connected, can't request P-GPS data");
		return;
	}

	err = location_assist_pgps_set_prediction_count(pgps_req->prediction_count);
	err |= location_assist_pgps_set_prediction_interval(pgps_req->prediction_period_min);
	location_assist_pgps_set_start_gps_day(pgps_req->gps_day);
	err |= location_assist_pgps_set_start_time(pgps_req->gps_time_of_day);
	if (err) {
		mosh_error("Failed to set P-GPS request parameters");
		return;
	}

	while ((err = location_assistance_pgps_request_send(cloud_lwm2m_client_ctx_get(), true)) ==
	       -EAGAIN) {
		/* LwM2M client utils library is currently handling an A-GPS data request, need to
		 * wait until it has been completed.
		 */
		k_sleep(K_SECONDS(1));
	}
	if (err) {
		mosh_error("Failed to request P-GPS data, err: %d", err);
	}
#endif /* CONFIG_MOSH_CLOUD_LWM2M */
}
#endif /* CONFIG_LOCATION_SERVICE_EXTERNAL && CONFIG_NRF_CLOUD_PGPS */

#if defined(CONFIG_LOCATION_SERVICE_EXTERNAL) && defined(CONFIG_LOCATION_METHOD_CELLULAR)
#if defined(CONFIG_MOSH_CLOUD_LWM2M)
static int location_ctrl_lwm2m_cell_result_cb(uint16_t obj_inst_id,
					      uint16_t res_id, uint16_t res_inst_id,
					      uint8_t *data, uint16_t data_len,
					      bool last_block, size_t total_size)
{
	int err;
	int32_t result;
	struct location_data location = {0};
	double temp_accuracy;

	if (data_len != sizeof(int32_t)) {
		mosh_error("Unexpected data length in callback");
		err = -1;
		goto exit;
	}

	result = (int32_t)*data;
	switch (result) {
	case LOCATION_ASSIST_RESULT_CODE_OK:
		break;

	case LOCATION_ASSIST_RESULT_CODE_PERMANENT_ERR:
	case LOCATION_ASSIST_RESULT_CODE_TEMP_ERR:
	default:
		mosh_error("LwM2M server failed to get location");
		err = -1;
		goto exit;
	}

	err = lwm2m_engine_get_float(LWM2M_PATH(GROUND_FIX_OBJECT_ID, 0, GROUND_FIX_LATITUDE),
				     &location.latitude);
	if (err) {
		mosh_error("Getting latitude from LwM2M engine failed, err: %d", err);
		goto exit;
	}

	err = lwm2m_engine_get_float(LWM2M_PATH(GROUND_FIX_OBJECT_ID, 0, GROUND_FIX_LONGITUDE),
				     &location.longitude);
	if (err) {
		mosh_error("Getting longitude from LwM2M engine failed, err: %d", err);
		goto exit;
	}

	err = lwm2m_engine_get_float(LWM2M_PATH(GROUND_FIX_OBJECT_ID, 0, GROUND_FIX_ACCURACY),
				     &temp_accuracy);
	if (err) {
		mosh_error("Getting accuracy from LwM2M engine failed, err: %d", err);
		goto exit;
	}
	location.accuracy = temp_accuracy;

exit:
	if (err) {
		location_cellular_ext_result_set(LOCATION_EXT_RESULT_ERROR, NULL);
	} else {
		location_cellular_ext_result_set(LOCATION_EXT_RESULT_SUCCESS, &location);
	}

