nrfconnect/sdk-nrf/samples/nrf9160/modem_shell/src/location/location_shell.c
	return err;
}
#endif /* CONFIG_MOSH_CLOUD_LWM2M */

static void location_ctrl_cellular_ext_handle(const struct lte_lc_cells_info *cell_info)
{
#if defined(CONFIG_MOSH_CLOUD_LWM2M)
	int err = -1;

	if (!cloud_lwm2m_is_connected()) {
		mosh_error("LwM2M not connected, can't send cellular location request");
		goto exit;
	}

	err = lwm2m_engine_register_post_write_callback(
		LWM2M_PATH(GROUND_FIX_OBJECT_ID, 0, GROUND_FIX_RESULT_CODE),
		location_ctrl_lwm2m_cell_result_cb);
	if (err) {
		mosh_error("Failed to register post write callback, err: %d", err);
	}

	ground_fix_set_report_back(true);

	err = lwm2m_update_signal_meas_objects(cell_info);
	if (err) {
		mosh_error("Failed to update LwM2M signal meas object, err: %d", err);
		goto exit;
	}

	err = location_assistance_ground_fix_request_send(cloud_lwm2m_client_ctx_get(), true);
	if (err) {
		mosh_error("Failed to send cellular location request, err: %d", err);
		goto exit;
	}

exit:
	if (err) {
		location_cellular_ext_result_set(LOCATION_EXT_RESULT_ERROR, NULL);
	}
#else /* !CONFIG_MOSH_CLOUD_LWM2M */
	location_cellular_ext_result_set(LOCATION_EXT_RESULT_ERROR, NULL);
#endif
}
#endif /* CONFIG_LOCATION_SERVICE_EXTERNAL && CONFIG_LOCATION_METHOD_CELLULAR */

void location_ctrl_event_handler(const struct location_event_data *event_data)
{
	switch (event_data->id) {
	case LOCATION_EVT_LOCATION:
		mosh_print("Location:");
		mosh_print(
			"  used method: %s (%d)",
			location_method_str(event_data->method),
			event_data->method);
		mosh_print("  latitude: %.06f", event_data->location.latitude);
		mosh_print("  longitude: %.06f", event_data->location.longitude);
		mosh_print("  accuracy: %.01f m", event_data->location.accuracy);
		if (event_data->location.datetime.valid) {
			mosh_print(
				"  date: %04d-%02d-%02d",
				event_data->location.datetime.year,
				event_data->location.datetime.month,
				event_data->location.datetime.day);
			mosh_print(
				"  time: %02d:%02d:%02d.%03d UTC",
				event_data->location.datetime.hour,
				event_data->location.datetime.minute,
				event_data->location.datetime.second,
				event_data->location.datetime.ms);
		}
		mosh_print(
			"  Google maps URL: https://maps.google.com/?q=%f,%f",
			event_data->location.latitude, event_data->location.longitude);

		if (gnss_location_to_cloud) {
			k_work_init(&gnss_location_work_data.work, location_to_cloud_worker);

			gnss_location_work_data.loc_evt_data = *event_data;
			gnss_location_work_data.format = gnss_location_to_cloud_format;
			k_work_submit_to_queue(&mosh_common_work_q, &gnss_location_work_data.work);
		}

#if defined(CONFIG_DK_LIBRARY)
		dk_set_led_on(LOCATION_STATUS_LED);
		k_work_reschedule_for_queue(&mosh_common_work_q, &location_evt_led_work,
			K_SECONDS(5));
#endif
		break;

	case LOCATION_EVT_TIMEOUT:
		mosh_error("Location request timed out");
		break;

	case LOCATION_EVT_ERROR:
		mosh_error("Location request failed");
		break;
	case LOCATION_EVT_GNSS_ASSISTANCE_REQUEST:
#if defined(CONFIG_LOCATION_SERVICE_EXTERNAL) && defined(CONFIG_NRF_CLOUD_AGPS)
		mosh_print(
			"A-GPS request from Location library "
			"(ephe: 0x%08x alm: 0x%08x flags: 0x%02x)",
			event_data->agps_request.sv_mask_ephe,
			event_data->agps_request.sv_mask_alm,
			event_data->agps_request.data_flags);
		location_ctrl_agps_ext_handle(&event_data->agps_request);
#endif
		break;
	case LOCATION_EVT_GNSS_PREDICTION_REQUEST:
#if defined(CONFIG_LOCATION_SERVICE_EXTERNAL) && defined(CONFIG_NRF_CLOUD_PGPS)
		mosh_print(
			"P-GPS request from Location library "
			"(prediction count: %d validity time: %d gps day: %d time of day: %d)",
			event_data->pgps_request.prediction_count,
			event_data->pgps_request.prediction_period_min,
			event_data->pgps_request.gps_day,
			event_data->pgps_request.gps_time_of_day);
		location_ctrl_pgps_ext_handle(&event_data->pgps_request);
#endif
		break;
	case LOCATION_EVT_CELLULAR_EXT_REQUEST:
#if defined(CONFIG_LOCATION_SERVICE_EXTERNAL) && defined(CONFIG_LOCATION_METHOD_CELLULAR)
		mosh_print("Cellular location request from Location library "
			   "(neighbor cells: %d GCI cells: %d)",
			   event_data->cellular_request.ncells_count,
			   event_data->cellular_request.gci_cells_count);
		location_ctrl_cellular_ext_handle(&event_data->cellular_request);
#endif
		break;
	case LOCATION_EVT_RESULT_UNKNOWN:
		mosh_print("Location request completed, but the result is not known");
		break;
	default:
		mosh_warn("Unknown event from location library, id %d", event_data->id);
		break;
	}
}

void location_ctrl_init(void)
{
	int ret;

#if defined(CONFIG_DK_LIBRARY)
	k_work_init_delayable(&location_evt_led_work, location_evt_led_worker);
#endif

	ret = location_init(location_ctrl_event_handler);
	if (ret) {
		mosh_error("Initializing the Location library failed, err: %d\n", ret);
	}
}

/******************************************************************************/

int location_shell(const struct shell *shell, size_t argc, char **argv)
{
	enum location_shell_command command = LOCATION_CMD_NONE;

	int interval = 0;
	bool interval_set = false;

	float timeout = 0;
	bool timeout_set = false;

	float gnss_timeout = 0;
	bool gnss_timeout_set = false;

	enum location_accuracy gnss_accuracy = 0;
	bool gnss_accuracy_set = false;

	int gnss_num_fixes = 0;
	bool gnss_num_fixes_set = false;

	bool gnss_visibility = false;

	bool gnss_priority_mode = false;

	float cellular_timeout = 0;
	bool cellular_timeout_set = false;
	enum location_service cellular_service = LOCATION_SERVICE_ANY;

	float wifi_timeout = 0;
	bool wifi_timeout_set = false;
	enum location_service wifi_service = LOCATION_SERVICE_ANY;

	enum location_method method_list[CONFIG_LOCATION_METHODS_LIST_SIZE] = { 0 };
	int method_count = 0;

	enum location_req_mode req_mode = LOCATION_REQ_MODE_FALLBACK;

	int opt;
	int ret = 0;
	int long_index = 0;

	gnss_location_to_cloud_format = NRF_CLOUD_GNSS_TYPE_PVT;

	if (argc < 2) {
		goto show_usage;
	}

	/* command = argv[0] = "location" */
	/* sub-command = argv[1] */
	if (strcmp(argv[1], "get") == 0) {
		command = LOCATION_CMD_GET;
	} else if (strcmp(argv[1], "cancel") == 0) {
		command = LOCATION_CMD_CANCEL;
	} else {
		mosh_error("Unsupported command=%s\n", argv[1]);
		ret = -EINVAL;
		goto show_usage;
	}

	/* Reset getopt due to possible previous failures */
	optreset = 1;

